{
    "708148": {
        "article_date_time": "2022-12-28, 19:45",
        "articles_title": "Метрика Churn Rate: что это и как посчитать?",
        "article_url": "https://habr.com/ru/company/joom/blog/708148/",
        "article_desc": "В этом посте мы расскажем про метрику Churn Rate."
    },
    "708280": {
        "article_date_time": "2022-12-28, 17:39",
        "articles_title": "Профессиональные задачи, которые вы можете решить с AI системой ChatGPT от OpenAI",
        "article_url": "https://habr.com/ru/post/708280/",
        "article_desc": "Мир охватила новая волна безумства вокруг AI, все соц.сети заполнены огромным количеством экспериментов вокруг нового продукта - ChatGPT. В этой статье я расскажу вам о 30+ самых интересных кейсов использования AI-чата на базе открытого искусственного интеллекта от OpenAI."
    },
    "707336": {
        "article_date_time": "2022-12-28, 10:00",
        "articles_title": "Миф или реальность? Типовые заблуждения про low-code инструменты анализа данных",
        "article_url": "https://habr.com/ru/post/707336/",
        "article_desc": "Вокруг технологий всегда появляются мифы: фотоаппараты, похищающие душу, подавляющий свободную волю 5G, искусственный интеллект, который захватывает планету и отправляет киборга в прошлое… Всё это - примеры, основанные на страхе неизвестного, который, в свою очередь, является неотъемлемым свойством человеческого мышления."
    },
    "707916": {
        "article_date_time": "2022-12-27, 12:00",
        "articles_title": "Лучшие новые библиотеки Python за 2022 год",
        "article_url": "https://habr.com/ru/post/707916/",
        "article_desc": "В пост включены библиотеки, которые были запущены или приобрели популярность в этом году, хорошо поддерживаются, а также просто классные и достойные внимания. Подборка в значительной степени ориентирована на библиотеки по ИИ и науке о данных, но сюда так же включен ряд библиотек, которые могут быть полезны для целей, не связанных с наукой о данных."
    },
    "707858": {
        "article_date_time": "2022-12-27, 09:49",
        "articles_title": "У вас нет причин использовать alpine для python-проектов",
        "article_url": "https://habr.com/ru/post/707858/",
        "article_desc": "По мотивам моего доклада на PyCon \"Контейнеризация Python без боли\". На своей практике я постоянно сталкиваюсь со спорами какой базовый образ лучше использовать для проектов: alpine или debian. Аргументы есть и у той, и у другой стороны, но мне это настолько надоело, что я решил сам разобраться и наконец-то поставить точку. В конце концов \"В наше время верить нельзя никому, даже себе. Но мне - можно.\" (с)"
    },
    "707832": {
        "article_date_time": "2022-12-27, 02:58",
        "articles_title": "Как мы внедряли полнотекстовый поиск",
        "article_url": "https://habr.com/ru/post/707832/",
        "article_desc": "Раньше я работала на проекте N, где главной бизнесовой сущностью было событие. Это событие имеет свое название и еще несколько полей.Когда-то нам пришел запрос от юзеров: событие у нас в системе называется, например, \"событие от Ивана Ивановича\", а они пытаются вбить в поиск \"иван иванович рассказал про X\" и не получают никаких результатов.Данная проблема решается с помощью полнотекстового поиска. Вопрос в том, как его реализовать."
    },
    "707698": {
        "article_date_time": "2022-12-26, 14:24",
        "articles_title": "Positive Technologies открыла доступ по запросу к сервису обнаружения вредоносных Python-пакетов PT PyAnalysis",
        "article_url": "https://habr.com/ru/news/t/707698/",
        "article_desc": "\n\r\nРазработчик решений для информационной безопасности компания Positive Technologies открыла доступ по запросу к сервису обнаружения вредоносных Python-пакетов в открытом ПО под названием PT PyAnalysis."
    },
    "706970": {
        "article_date_time": "2022-12-26, 13:00",
        "articles_title": "Как мы сделали и оптимизировали механизм правил для персонализации UI",
        "article_url": "https://habr.com/ru/company/kts/blog/706970/",
        "article_desc": "Всем привет! Меня зовут Александр, я занимаюсь backend-разработкой в KTS. "
    },
    "707556": {
        "article_date_time": "2022-12-26, 08:30",
        "articles_title": "ИИ в конце 2022 года или как ИИ может помочь создать видеоролик",
        "article_url": "https://habr.com/ru/post/707556/",
        "article_desc": "2022 год уходит. Чем же он нам запомнился? Несомненно, одно из последних достижений года - ChatGPT, самая спорная вещь в комьюнити: кто-то говорит “зачем такое создавать, роботы скоро оставят миллионы журналистов, писателей, блогеров, креаторов без работы”, другие же напротив, считают эту сетку огромным прорывом. Вишенка на торте - это, конечно, Stable Diffusion от компании Stability AI. Эта нейронная сеть была выложена в открытый доступ, что сразу привлекло внимание всех разработчиков. И это лишь малая часть того, что появилось в уходящем году."
    },
    "707442": {
        "article_date_time": "2022-12-24, 07:17",
        "articles_title": "ML алгоритм нашел баг в моем коде…",
        "article_url": "https://habr.com/ru/post/707442/",
        "article_desc": "Я играл с языковой моделью SalesForce CodeGen. Она генерирует новый код по подсказкам. Но я хотел посмотреть, как она будет анализировать уже написанный код."
    },
    "707380": {
        "article_date_time": "2022-12-23, 16:45",
        "articles_title": "Как (и зачем) я писал README в Jupyter-ноутбуке для Node.js-приложения",
        "article_url": "https://habr.com/ru/post/707380/",
        "article_desc": "На одном из прошлых мест работы я поддерживал консольную Node.js-утилиту, которая публиковалась в NPM. Утилита использовала commander, содержала довольно большое количество подкоманд, и все они требовали описания в README-файле, которое нужно было не забывать обновлять при каждом изменении. Несколько лет спустя я нашел решение, используя не слишком привычные для экосистемы Node.js технологии."
    }
}